FireVirtuozz/ESP32/esp_project/components/systemLib/systemLib.c
#include "systemLib.h"
#include <hal/efuse_hal.h>
#include "esp_app_format.h"
#include "esp_image_format.h"
#include "logLib.h"
#include "esp_chip_info.h"
#include "esp_system.h"
#include "esp_idf_version.h"
#include "esp_mac.h"
#include "esp_app_desc.h"
#include "esp_cpu.h"

#include "esp_partition.h"
#include "esp_bootloader_desc.h"

#include "esp_efuse_chip.h"
#include "esp_efuse.h"
#include "esp_efuse_table.h"

#include "esp_event.h"

#include "esp_mmu_map.h"

#if !CONFIG_IDF_TARGET_ESP32

typedef struct {
    int start;
    int end;
} range_addr_t;

const range_addr_t range_read_addr_blocks_user[] = {
    {EFUSE_RD_WR_DIS_REG,       EFUSE_RD_REPEAT_DATA4_REG},      // range address of EFUSE_BLK0  REPEAT
    {EFUSE_RD_MAC_SPI_SYS_0_REG, EFUSE_RD_MAC_SPI_SYS_5_REG},      // range address of EFUSE_BLK1  MAC_SPI_8M
    {EFUSE_RD_SYS_PART1_DATA0_REG,    EFUSE_RD_SYS_PART1_DATA7_REG},         // range address of EFUSE_BLK2  SYS_DATA
    {EFUSE_RD_USR_DATA0_REG,    EFUSE_RD_USR_DATA7_REG},         // range address of EFUSE_BLK3  USR_DATA
    {EFUSE_RD_KEY0_DATA0_REG,   EFUSE_RD_KEY0_DATA7_REG},        // range address of EFUSE_BLK4  KEY0
    {EFUSE_RD_KEY1_DATA0_REG,   EFUSE_RD_KEY1_DATA7_REG},        // range address of EFUSE_BLK5  KEY1
    {EFUSE_RD_KEY2_DATA0_REG,   EFUSE_RD_KEY2_DATA7_REG},        // range address of EFUSE_BLK6  KEY2
    {EFUSE_RD_KEY3_DATA0_REG,   EFUSE_RD_KEY3_DATA7_REG},        // range address of EFUSE_BLK7  KEY3
    {EFUSE_RD_KEY4_DATA0_REG,   EFUSE_RD_KEY4_DATA7_REG},        // range address of EFUSE_BLK8  KEY4
    {EFUSE_RD_KEY5_DATA0_REG,   EFUSE_RD_KEY5_DATA7_REG},        // range address of EFUSE_BLK9  KEY5
    {EFUSE_RD_SYS_PART2_DATA0_REG,   EFUSE_RD_SYS_PART2_DATA7_REG}         // range address of EFUSE_BLK10 KEY6
};

#endif


static const char *TAG = "system_library";

static const char *get_model_str(esp_chip_model_t model)
{
    switch (model) {

        case CHIP_ESP32:
            return "ESP32";

        case CHIP_ESP32S2:
            return "ESP32-S2";

        case CHIP_ESP32S3:
            return "ESP32-S3";

        case CHIP_ESP32C3:
            return "ESP32-C3";

        case CHIP_ESP32C2:
            return "ESP32-C2";

        case CHIP_ESP32C6:
            return "ESP32-C6";

        case CHIP_ESP32C61:
            return "ESP32-C61";

        case CHIP_ESP32C5:
            return "ESP32-C5";

        case CHIP_ESP32H2:
            return "ESP32-H2";

        case CHIP_ESP32H21:
            return "ESP32-H21";

        case CHIP_ESP32H4:
            return "ESP32-H4";

        case CHIP_ESP32P4:
            return "ESP32-P4";

        case CHIP_ESP32S31:
            return "ESP32-S3.1";

        case CHIP_POSIX_LINUX:
            return "POSIX/Linux simulator";

        default:
            return "Unknown ESP chip";
    }
}

static const char *get_chip_id_str(esp_chip_id_t model)
{
    switch (model) {

        case ESP_CHIP_ID_ESP32:
            return "ESP32";

        case ESP_CHIP_ID_ESP32S2:
            return "ESP32-S2";

        case ESP_CHIP_ID_ESP32S3:
            return "ESP32-S3";

        case ESP_CHIP_ID_ESP32C3:
            return "ESP32-C3";

        case ESP_CHIP_ID_ESP32C2:
            return "ESP32-C2";

        case ESP_CHIP_ID_ESP32C6:
            return "ESP32-C6";

        case ESP_CHIP_ID_ESP32C61:
            return "ESP32-C61";

        case ESP_CHIP_ID_ESP32C5:
            return "ESP32-C5";

        case ESP_CHIP_ID_ESP32H2:
            return "ESP32-H2";

        case ESP_CHIP_ID_ESP32H21:
            return "ESP32-H21";

        case ESP_CHIP_ID_ESP32H4:
            return "ESP32-H4";

        case ESP_CHIP_ID_ESP32P4:
            return "ESP32-P4";

        case ESP_CHIP_ID_ESP32S31:
            return "ESP32-S3.1";

        case ESP_CHIP_ID_INVALID:
            return "Invalid chip id";

        default:
            return "Unknown ESP chip id";
    }
}

static const char *get_spi_mode_str(esp_image_spi_mode_t mode)
{
    switch (mode) {
        case ESP_IMAGE_SPI_MODE_QIO:        return "QIO";
        case ESP_IMAGE_SPI_MODE_QOUT:       return "QOUT";
        case ESP_IMAGE_SPI_MODE_DIO:        return "DIO";
        case ESP_IMAGE_SPI_MODE_DOUT:       return "DOUT";
        case ESP_IMAGE_SPI_MODE_FAST_READ:  return "FAST_READ";
        case ESP_IMAGE_SPI_MODE_SLOW_READ:  return "SLOW_READ";
        default:                            return "Unknown SPI mode";
    }
}

static const char *get_spi_speed_str(esp_image_spi_freq_t speed)
{
    switch (speed) {
        case ESP_IMAGE_SPI_SPEED_DIV_1:  return "DIV_1 (full speed)";
        case ESP_IMAGE_SPI_SPEED_DIV_2:  return "DIV_2";
        case ESP_IMAGE_SPI_SPEED_DIV_3:  return "DIV_3";
        case ESP_IMAGE_SPI_SPEED_DIV_4:  return "DIV_4";
        default:                         return "Unknown SPI speed";
    }
}

static const char *get_flash_size_str(esp_image_flash_size_t size)
{
    switch (size) {
        case ESP_IMAGE_FLASH_SIZE_1MB:   return "1 MB";
        case ESP_IMAGE_FLASH_SIZE_2MB:   return "2 MB";
        case ESP_IMAGE_FLASH_SIZE_4MB:   return "4 MB";
        case ESP_IMAGE_FLASH_SIZE_8MB:   return "8 MB";
        case ESP_IMAGE_FLASH_SIZE_16MB:  return "16 MB";
        case ESP_IMAGE_FLASH_SIZE_32MB:  return "32 MB";
        case ESP_IMAGE_FLASH_SIZE_64MB:  return "64 MB";
        case ESP_IMAGE_FLASH_SIZE_128MB: return "128 MB";
        case ESP_IMAGE_FLASH_SIZE_MAX:   return "MAX";
        default:                         return "Unknown flash size";
    }
}

static const char *get_efuse_block_str(esp_efuse_block_t block)
{
#if CONFIG_IDF_TARGET_ESP32
    switch (block) {
        case EFUSE_BLK0:  return "BLK0  (RESERVED)";
        case EFUSE_BLK1:  return "BLK1  (FLASH ENCRYPTION)";
        case EFUSE_BLK2:  return "BLK2  (SECURE BOOT)";
        case EFUSE_BLK3:  return "BLK3  (USER)";
        default:          return "Unknown block";
    }
#else
    switch (block) {
        case EFUSE_BLK0:               return "BLK0 (REPEAT/SYSTEM)";
        case EFUSE_BLK1:               return "BLK1 (MAC_SPI_8M_SYS)";
        case EFUSE_BLK2:               return "BLK2 (SYS_DATA_PART1)";
        case EFUSE_BLK3:               return "BLK3 (USER_DATA)";
        case EFUSE_BLK4:               return "BLK4 (KEY0)";
        case EFUSE_BLK5:               return "BLK5 (KEY1)";
        case EFUSE_BLK6:               return "BLK6 (KEY2)";
        case EFUSE_BLK7:               return "BLK7 (KEY3)";
        case EFUSE_BLK8:               return "BLK8 (KEY4)";
        case EFUSE_BLK9:               return "BLK9 (KEY5)";
        case EFUSE_BLK10:              return "BLK10 (SYS_DATA_PART2)";
        default:                       return "Unknown block";
    }
#endif
}

#if CONFIG_IDF_TARGET_ESP32
static const char *get_coding_scheme_str(esp_efuse_coding_scheme_t scheme)
{
    switch (scheme) {
        case EFUSE_CODING_SCHEME_NONE: return "NONE";
        case EFUSE_CODING_SCHEME_3_4:   return "(3/4 coding)";
        case EFUSE_CODING_SCHEME_REPEAT:   return "(repeat coding)";
        default:                       return "Unknown coding scheme";
    }
}
#endif

static const char *get_key_purpose_str(esp_efuse_purpose_t purpose)
{
#if CONFIG_IDF_TARGET_ESP32
    switch (purpose) {
        case ESP_EFUSE_KEY_PURPOSE_USER:                        return "USER";
        case ESP_EFUSE_KEY_PURPOSE_SYSTEM:                    return "SYSTEM";
        case ESP_EFUSE_KEY_PURPOSE_FLASH_ENCRYPTION:           return "FLASH ENCRYPTION";
        case ESP_EFUSE_KEY_PURPOSE_SECURE_BOOT_V2:           return "SECURE BOOT";
        case ESP_EFUSE_KEY_PURPOSE_MAX:                         return "MAX";
        default:                                                return "Unknown purpose";
    }
#endif
#if CONFIG_IDF_TARGET_ESP32S3
    switch (purpose) {
        case ESP_EFUSE_KEY_PURPOSE_USER:                          return "USER (Software only)";
        case ESP_EFUSE_KEY_PURPOSE_RESERVED:                      return "RESERVED";
        case ESP_EFUSE_KEY_PURPOSE_XTS_AES_256_KEY_1:             return "XTS_AES_256_KEY_1 (Flash/PSRAM)";
        case ESP_EFUSE_KEY_PURPOSE_XTS_AES_256_KEY_2:             return "XTS_AES_256_KEY_2 (Flash/PSRAM)";
        case ESP_EFUSE_KEY_PURPOSE_XTS_AES_128_KEY:               return "XTS_AES_128_KEY (Flash/PSRAM)";
        case ESP_EFUSE_KEY_PURPOSE_HMAC_DOWN_ALL:                 return "HMAC Downstream All";
        case ESP_EFUSE_KEY_PURPOSE_HMAC_DOWN_JTAG:                return "HMAC Downstream JTAG (Soft enable)";
        case ESP_EFUSE_KEY_PURPOSE_HMAC_DOWN_DIGITAL_SIGNATURE:   return "HMAC Downstream Digital Signature";
        case ESP_EFUSE_KEY_PURPOSE_HMAC_UP:                       return "HMAC Upstream";
        case ESP_EFUSE_KEY_PURPOSE_SECURE_BOOT_DIGEST0:           return "SECURE_BOOT_DIGEST0";
        case ESP_EFUSE_KEY_PURPOSE_SECURE_BOOT_DIGEST1:           return "SECURE_BOOT_DIGEST1";
        case ESP_EFUSE_KEY_PURPOSE_SECURE_BOOT_DIGEST2:           return "SECURE_BOOT_DIGEST2";
        case ESP_EFUSE_KEY_PURPOSE_MAX:                           return "MAX";
        default:                                                  return "Unknown purpose";
    }
#endif
#if CONFIG_IDF_TARGET_ESP32C6
    switch (purpose) {
        case ESP_EFUSE_KEY_PURPOSE_USER:                          return "USER (Software only)";
        case ESP_EFUSE_KEY_PURPOSE_RESERVED:                      return "RESERVED";
        case ESP_EFUSE_KEY_PURPOSE_XTS_AES_128_KEY:               return "XTS_AES_128_KEY (Flash/PSRAM)";
        case ESP_EFUSE_KEY_PURPOSE_HMAC_DOWN_ALL:                 return "HMAC Downstream All";
        case ESP_EFUSE_KEY_PURPOSE_HMAC_DOWN_JTAG:                return "HMAC Downstream JTAG (Soft enable)";
        case ESP_EFUSE_KEY_PURPOSE_HMAC_DOWN_DIGITAL_SIGNATURE:   return "HMAC Downstream Digital Signature";
        case ESP_EFUSE_KEY_PURPOSE_HMAC_UP:                       return "HMAC Upstream";
        case ESP_EFUSE_KEY_PURPOSE_SECURE_BOOT_DIGEST0:           return "SECURE_BOOT_DIGEST0";
        case ESP_EFUSE_KEY_PURPOSE_SECURE_BOOT_DIGEST1:           return "SECURE_BOOT_DIGEST1";
        case ESP_EFUSE_KEY_PURPOSE_SECURE_BOOT_DIGEST2:           return "SECURE_BOOT_DIGEST2";
        case ESP_EFUSE_KEY_PURPOSE_MAX:                           return "MAX";
        default:                                                  return "Unknown purpose";
    }
#endif
    return "Unknown target";
}


void print_chip_info() {

    esp_err_t err;
    dump_t *d = NULL;

    // ====================== EFUSE REVISION ======================
    d = dump_init("EFUSE REVISION", TAG);
    uint8_t mac[6];
    efuse_hal_get_mac(mac);
    dump_add_line(d, "Factory MAC address : %02X:%02X:%02X:%02X:%02X:%02X",
         mac[5], mac[4], mac[3], mac[2], mac[1], mac[0]);
    dump_add_line(d, "chip block revision : %d", efuse_hal_blk_version());
    dump_add_line(d, "flash encryption enabled : %s",
        efuse_hal_flash_encryption_enabled() ? "Yes" : "No");
    dump_add_line(d, "Skip maximum version check : %s",
        efuse_hal_get_disable_wafer_version_major() ? "Yes" : "No");
    dump_add_line(d, "Skip block version check : %s",
        efuse_hal_get_disable_blk_version_major() ? "Yes" : "No");
    dump_add_line(d, "chip revision : %d", efuse_hal_chip_revision());
    dump_add_line(d, "major chip version : %d", efuse_hal_get_major_chip_version());
    dump_add_line(d, "minor chip version : %d", efuse_hal_get_minor_chip_version());
    dump_add_line(d, "chip package version : %d", efuse_hal_get_chip_ver_pkg());
    dump_deploy(&d);

