FireVirtuozz/ESP32/esp_project/components/systemLib/systemLib.c
    // ========== CHIP INFO ==========
    esp_chip_info_t chip;
    esp_chip_info(&chip);
    d = dump_init("CHIP INFO", TAG);
    dump_add_line(d, "Model        : %s", get_model_str(chip.model));
    dump_add_line(d, "Cores        : %d", chip.cores);
    dump_add_line(d, "Revision     : %d", chip.revision);
    dump_add_line(d, "WiFi 2.4GHz=%d BT Classic=%d BLE=%d",
             chip.features & CHIP_FEATURE_WIFI_BGN,
             chip.features & CHIP_FEATURE_BT,
             chip.features & CHIP_FEATURE_BLE);
    dump_add_line(d, "EMB_FLASH=%d IEEE 802.15.4=%d PSRAM=%d",
             chip.features & CHIP_FEATURE_EMB_FLASH,
             chip.features & CHIP_FEATURE_IEEE802154,
             chip.features & CHIP_FEATURE_EMB_PSRAM);
    dump_deploy(&d);

    // ========== MEMORY ==========
    d = dump_init("MEMORY", TAG);
    dump_add_line(d, "Free heap          : %u bytes", esp_get_free_heap_size());
    dump_add_line(d, "Free internal heap : %u bytes", esp_get_free_internal_heap_size());
    dump_add_line(d, "Minimum free heap  : %u bytes", esp_get_minimum_free_heap_size());
    dump_deploy(&d);

    // ========== MAC ==========
    d = dump_init("MAC", TAG);
    uint8_t base_mac[6], efuse_mac[6];
    err = esp_base_mac_addr_get(base_mac);
    if (err == ESP_OK) {
        dump_add_line(d, "Base MAC  : %02X:%02X:%02X:%02X:%02X:%02X",
            base_mac[0], base_mac[1], base_mac[2], base_mac[3], base_mac[4], base_mac[5]);
    } else {
        dump_add_line(d, "Error (%s) getting base MAC", esp_err_to_name(err));
    }
    err = esp_efuse_mac_get_default(efuse_mac);
    if (err == ESP_OK) {
        dump_add_line(d, "EFUSE MAC : %02X:%02X:%02X:%02X:%02X:%02X",
            efuse_mac[0], efuse_mac[1], efuse_mac[2], efuse_mac[3], efuse_mac[4], efuse_mac[5]);
    } else {
        dump_add_line(d, "Error (%s) getting efuse MAC", esp_err_to_name(err));
    }
    dump_deploy(&d);

    // ========== CPU ==========
    d = dump_init("CPU", TAG);
    dump_add_line(d, "Cycle cnt  : %u", esp_cpu_get_cycle_count());
    dump_add_line(d, "Stack ptr  : %p", esp_cpu_get_sp());
    dump_add_line(d, "Core ID    : %d", esp_cpu_get_core_id());
    dump_add_line(d, "Enabled IRQ mask   : 0x%X", esp_cpu_intr_get_enabled_mask());
    dump_add_line(d, "Debugger attached  : %d", esp_cpu_dbgr_is_attached());
    dump_add_line(d, "Thread ptr         : %p", esp_cpu_get_threadptr());
    dump_add_line(d, "Privilege level    : %d", esp_cpu_get_curr_privilege_level());
    dump_deploy(&d);

    // ========== APP ==========
    d = dump_init("APP", TAG);
    dump_add_line(d, "ESP-IDF version    : %s", esp_get_idf_version());
    const esp_app_desc_t *app_desc = esp_app_get_description();
    if (app_desc) {
        dump_add_line(d, "Project name  : %s", app_desc->project_name);
        dump_add_line(d, "App version   : %s", app_desc->version);
        dump_add_line(d, "IDF version   : %s", app_desc->idf_ver);
        dump_add_line(d, "Compile time  : %s %s", app_desc->date, app_desc->time);
        dump_add_line(d, "Magic word  : 0x%X (%s)", app_desc->magic_word,
            app_desc->magic_word == ESP_APP_DESC_MAGIC_WORD ? "valid" : "INVALID");
        dump_add_line(d, "Secure version  : %u", app_desc->secure_version);
        dump_add_line(d, "reserv1[0]  : 0x%X", app_desc->reserv1[0]);
        dump_add_line(d, "reserv1[1]  : 0x%X", app_desc->reserv1[1]);
        dump_add_line(d, "Minimal efuse block  : %u", app_desc->min_efuse_blk_rev_full);
        dump_add_line(d, "Maximal efuse block  : %u", app_desc->max_efuse_blk_rev_full);
        dump_add_line(d, "MMU page size (log2)  : %u", app_desc->mmu_page_size);
        dump_add_line(d, "ELF SHA256    : %s", esp_app_get_elf_sha256_str());
    } else {
        dump_add_line(d, "App description not available");
    }
    dump_deploy(&d);

    // ========== APP HEADER ==========
    const esp_partition_t *partition = esp_partition_find_first(
        ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, NULL);
    d = dump_init("APP HEADER", TAG);
    if (partition == NULL) {
        dump_add_line(d, "Error accessing app partition");
    } else {
        void *param = malloc(sizeof(esp_image_header_t));
        err = esp_partition_read(partition, 0, param, sizeof(esp_image_header_t));
        esp_image_header_t *h = (esp_image_header_t *)param;
        if (err == ESP_OK && h != NULL) {
            dump_add_line(d, "Magic           : 0x%02X (%s)", h->magic,
                    h->magic == ESP_IMAGE_HEADER_MAGIC ? "valid" : "INVALID");
            dump_add_line(d, "Segment count   : %u",    h->segment_count);
            dump_add_line(d, "SPI mode        : %s",    get_spi_mode_str(h->spi_mode));
            dump_add_line(d, "SPI speed       : %s",    get_spi_speed_str(h->spi_speed));
            dump_add_line(d, "SPI size        : %s",    get_flash_size_str(h->spi_size));
            dump_add_line(d, "Entry addr      : 0x%08lX", h->entry_addr);
            dump_add_line(d, "WP pin          : 0x%02X (%s)", h->wp_pin,
                    h->wp_pin == 0xEE ? "disabled" : "enabled");
            dump_add_line(d, "SPI pin drv     : [%u, %u, %u]",
                    h->spi_pin_drv[0], h->spi_pin_drv[1], h->spi_pin_drv[2]);
            dump_add_line(d, "Chip ID         : %s",    get_chip_id_str(h->chip_id));
            dump_add_line(d, "Min chip rev    : %u (legacy)", h->min_chip_rev);
            dump_add_line(d, "Min chip rev    : %u.%u (full)",
                    h->min_chip_rev_full / 100, h->min_chip_rev_full % 100);
            dump_add_line(d, "Max chip rev    : %u.%u (full)",
                    h->max_chip_rev_full / 100, h->max_chip_rev_full % 100);
            dump_add_line(d, "Reserved        : [0x%02X, 0x%02X, 0x%02X, 0x%02X]",
                    h->reserved[0], h->reserved[1], h->reserved[2], h->reserved[3]);
            dump_add_line(d, "Hash appended   : %s", h->hash_appended ? "yes (SHA256)" : "no");
        } else {
            dump_add_line(d, "Error (%s) reading header partition", esp_err_to_name(err));
        }
        free(param);
    }
    dump_deploy(&d);

    // ========== BOOTLOADER DESCRIPTION ==========
    d = dump_init("BOOTLOADER", TAG);
    const esp_bootloader_desc_t *boot_desc = esp_bootloader_get_description();
    if (boot_desc != NULL) {
        dump_add_line(d, "Magic byte      : 0x%02X (%s)", boot_desc->magic_byte,
                boot_desc->magic_byte == ESP_BOOTLOADER_DESC_MAGIC_BYTE ? "valid" : "INVALID");
        dump_add_line(d, "Secure version  : %u",    boot_desc->secure_version);
        dump_add_line(d, "Version         : %lu",   boot_desc->version);
        dump_add_line(d, "IDF version     : %s",    boot_desc->idf_ver);
        dump_add_line(d, "Compile time    : %s",    boot_desc->date_time);
        dump_add_line(d, "Reserved        : [0x%02X, 0x%02X]",
                boot_desc->reserved[0], boot_desc->reserved[1]);
        dump_add_line(d, "Reserved2       : [0x%02X, 0x%02X, 0x%02X, 0x%02X, ...]",
                boot_desc->reserved2[0], boot_desc->reserved2[1],
                boot_desc->reserved2[2], boot_desc->reserved2[3]);
    } else {
        dump_add_line(d, "Error getting bootloader description");
    }
    dump_deploy(&d);

    // ========== EFUSE GLOBAL ==========
    d = dump_init("EFUSE GLOBAL", TAG);
    uint32_t sec_ver = esp_efuse_read_secure_version();
    dump_add_line(d, "Flash encryption : %s", esp_efuse_is_flash_encryption_enabled() ? "ENABLED" : "disabled");
    dump_add_line(d, "Secure version   : %u", sec_ver);
    dump_add_line(d, "Secure version valid : %s", esp_efuse_check_secure_version(sec_ver) ? "Yes" : "No");
    dump_add_line(d, "Pkg version      : %u", esp_efuse_get_pkg_ver());
    esp_err_t efuse_err = esp_efuse_check_errors();
    dump_add_line(d, "eFuse errors     : %s", efuse_err == ESP_OK ? "none" : esp_err_to_name(efuse_err));
    dump_deploy(&d);

    // ========== EFUSE BLOCKS ==========
    for (esp_efuse_block_t block = EFUSE_BLK0; block < EFUSE_BLK_MAX; block++) {

        char block_tag[32];
        snprintf(block_tag, sizeof(block_tag), "EFUSE %s", get_efuse_block_str(block));
        d = dump_init(block_tag, TAG);

        bool is_key_block = (block >= EFUSE_BLK_KEY0 && block < EFUSE_BLK_KEY_MAX);
        bool rd_dis = false;
        if (is_key_block) {
            rd_dis = esp_efuse_get_key_dis_read(block);
        }

