FireVirtuozz/ESP32/esp_project/components/systemLib/systemLib.c
        if (rd_dis) {
            dump_add_line(d, "Block protected (Read disabled)");
        } else if (block == EFUSE_BLK0) {

            #if CONFIG_IDF_TARGET_ESP32

            esp_efuse_coding_scheme_t scheme = esp_efuse_get_coding_scheme(block);
            bool empty = esp_efuse_block_is_empty(block);
            dump_add_line(d, "scheme: %-20s | empty: %s",
                get_coding_scheme_str(scheme), empty ? "yes" : "no");
            // -- EFUSE BLK0 : VERSIONS --
            uint8_t chip_rev1 = 0, chip_rev2 = 0, wafer_minor = 0;
            esp_efuse_read_field_blob(ESP_EFUSE_CHIP_VER_REV1,       &chip_rev1,   esp_efuse_get_field_size(ESP_EFUSE_CHIP_VER_REV1));
            esp_efuse_read_field_blob(ESP_EFUSE_CHIP_VER_REV2,       &chip_rev2,   esp_efuse_get_field_size(ESP_EFUSE_CHIP_VER_REV2));
            esp_efuse_read_field_blob(ESP_EFUSE_WAFER_VERSION_MINOR, &wafer_minor, esp_efuse_get_field_size(ESP_EFUSE_WAFER_VERSION_MINOR));
            dump_add_line(d, "CHIP_VER_REV1        : %u (size: %d)", chip_rev1,   esp_efuse_get_field_size(ESP_EFUSE_CHIP_VER_REV1));
            dump_add_line(d, "CHIP_VER_REV2        : %u (size: %d)", chip_rev2,   esp_efuse_get_field_size(ESP_EFUSE_CHIP_VER_REV2));
            dump_add_line(d, "WAFER_VERSION_MINOR  : %u (size: %d)", wafer_minor, esp_efuse_get_field_size(ESP_EFUSE_WAFER_VERSION_MINOR));

            uint8_t chip_pkg = 0, chip_pkg_4bit = 0;
            esp_efuse_read_field_blob(ESP_EFUSE_CHIP_PACKAGE,      &chip_pkg,      esp_efuse_get_field_size(ESP_EFUSE_CHIP_PACKAGE));
            esp_efuse_read_field_blob(ESP_EFUSE_CHIP_PACKAGE_4BIT, &chip_pkg_4bit, esp_efuse_get_field_size(ESP_EFUSE_CHIP_PACKAGE_4BIT));
            dump_add_line(d, "CHIP_PACKAGE         : %u (size: %d)", chip_pkg,      esp_efuse_get_field_size(ESP_EFUSE_CHIP_PACKAGE));
            dump_add_line(d, "CHIP_PACKAGE_4BIT    : %u (size: %d)", chip_pkg_4bit, esp_efuse_get_field_size(ESP_EFUSE_CHIP_PACKAGE_4BIT));

            uint8_t mac_crc = 0;
            esp_efuse_read_field_blob(ESP_EFUSE_MAC_CRC, &mac_crc, esp_efuse_get_field_size(ESP_EFUSE_MAC_CRC));
            dump_add_line(d, "MAC_CRC              : 0x%02X (size: %d)", mac_crc, esp_efuse_get_field_size(ESP_EFUSE_MAC_CRC));

            uint8_t coding = 0;
            esp_efuse_read_field_blob(ESP_EFUSE_CODING_SCHEME, &coding, esp_efuse_get_field_size(ESP_EFUSE_CODING_SCHEME));
            dump_add_line(d, "CODING_SCHEME        : %s (size: %d)", get_coding_scheme_str(coding), esp_efuse_get_field_size(ESP_EFUSE_CODING_SCHEME));
            dump_deploy(&d);

            // -- EFUSE BLK0 : SECURITY --
            d = dump_init("EFUSE BLK0 SECURITY", TAG);
            dump_add_line(d, "JTAG_DISABLE         : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_JTAG_DISABLE)            ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_JTAG_DISABLE));
            dump_add_line(d, "ABS_DONE_0           : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_ABS_DONE_0)              ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_ABS_DONE_0));
            dump_add_line(d, "ABS_DONE_1           : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_ABS_DONE_1)              ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_ABS_DONE_1));
            dump_add_line(d, "DISABLE_DL_ENCRYPT   : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_DISABLE_DL_ENCRYPT)      ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_DISABLE_DL_ENCRYPT));
            dump_add_line(d, "DISABLE_DL_DECRYPT   : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_DISABLE_DL_DECRYPT)      ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_DISABLE_DL_DECRYPT));
            dump_add_line(d, "DISABLE_DL_CACHE     : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_DISABLE_DL_CACHE)        ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_DISABLE_DL_CACHE));
            dump_add_line(d, "UART_DOWNLOAD_DIS    : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_UART_DOWNLOAD_DIS)       ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_UART_DOWNLOAD_DIS));
            dump_add_line(d, "KEY_STATUS           : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_KEY_STATUS)              ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_KEY_STATUS));
            dump_add_line(d, "CONSOLE_DEBUG_DIS    : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_CONSOLE_DEBUG_DISABLE)   ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_CONSOLE_DEBUG_DISABLE));
            dump_add_line(d, "DISABLE_SDIO_HOST    : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_DISABLE_SDIO_HOST)       ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_DISABLE_SDIO_HOST));
            dump_add_line(d, "DISABLE_APP_CPU      : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_DISABLE_APP_CPU)         ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_DISABLE_APP_CPU));
            dump_add_line(d, "DISABLE_BT           : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_DISABLE_BT)              ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_DISABLE_BT));
            dump_add_line(d, "DIS_CACHE            : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_DIS_CACHE)               ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_DIS_CACHE));
            dump_add_line(d, "BLK3_PART_RESERVE    : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_BLK3_PART_RESERVE)       ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_BLK3_PART_RESERVE));
            dump_add_line(d, "CHIP_CPU_FREQ_RATED  : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_CHIP_CPU_FREQ_RATED)     ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_CHIP_CPU_FREQ_RATED));
            dump_add_line(d, "CHIP_CPU_FREQ_LOW    : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_CHIP_CPU_FREQ_LOW)       ? "YES" : "no", esp_efuse_get_field_size(ESP_EFUSE_CHIP_CPU_FREQ_LOW));
            dump_deploy(&d);

            // -- EFUSE BLK0 : FLASH / CLOCK / SPI --
            d = dump_init("EFUSE BLK0 FLASH SPI", TAG);
            uint8_t wr_dis = 0, rd_dis = 0;
            esp_efuse_read_field_blob(ESP_EFUSE_WR_DIS, &wr_dis, esp_efuse_get_field_size(ESP_EFUSE_WR_DIS));
            esp_efuse_read_field_blob(ESP_EFUSE_RD_DIS, &rd_dis, esp_efuse_get_field_size(ESP_EFUSE_RD_DIS));
            dump_add_line(d, "WR_DIS               : 0x%04X (size: %d)", wr_dis, esp_efuse_get_field_size(ESP_EFUSE_WR_DIS));
            dump_add_line(d, "RD_DIS               : 0x%01X  (size: %d)", rd_dis, esp_efuse_get_field_size(ESP_EFUSE_RD_DIS));

            uint8_t flash_crypt_cnt = 0, flash_crypt_cfg = 0;
            esp_efuse_read_field_blob(ESP_EFUSE_FLASH_CRYPT_CNT,    &flash_crypt_cnt, esp_efuse_get_field_size(ESP_EFUSE_FLASH_CRYPT_CNT));
            esp_efuse_read_field_blob(ESP_EFUSE_FLASH_CRYPT_CONFIG, &flash_crypt_cfg, esp_efuse_get_field_size(ESP_EFUSE_FLASH_CRYPT_CONFIG));
            dump_add_line(d, "FLASH_CRYPT_CNT      : %u (%s) (size: %d)", flash_crypt_cnt,
                    (__builtin_popcount(flash_crypt_cnt) % 2 == 1) ? "encryption ON" : "encryption OFF",
                    esp_efuse_get_field_size(ESP_EFUSE_FLASH_CRYPT_CNT));
            dump_add_line(d, "FLASH_CRYPT_CONFIG   : 0x%X (size: %d)", flash_crypt_cfg, esp_efuse_get_field_size(ESP_EFUSE_FLASH_CRYPT_CONFIG));

            uint8_t clk8m = 0, adc_vref = 0, vol_level = 0;
            esp_efuse_read_field_blob(ESP_EFUSE_CLK8M_FREQ,       &clk8m,     esp_efuse_get_field_size(ESP_EFUSE_CLK8M_FREQ));
            esp_efuse_read_field_blob(ESP_EFUSE_ADC_VREF,         &adc_vref,  esp_efuse_get_field_size(ESP_EFUSE_ADC_VREF));
            esp_efuse_read_field_blob(ESP_EFUSE_VOL_LEVEL_HP_INV, &vol_level, esp_efuse_get_field_size(ESP_EFUSE_VOL_LEVEL_HP_INV));
            dump_add_line(d, "CLK8M_FREQ           : %u (size: %d)", clk8m,     esp_efuse_get_field_size(ESP_EFUSE_CLK8M_FREQ));
            dump_add_line(d, "ADC_VREF             : %u (size: %d)", adc_vref,  esp_efuse_get_field_size(ESP_EFUSE_ADC_VREF));
            dump_add_line(d, "VOL_LEVEL_HP_INV     : %u (size: %d)", vol_level, esp_efuse_get_field_size(ESP_EFUSE_VOL_LEVEL_HP_INV));

            dump_add_line(d, "XPD_SDIO_REG         : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_XPD_SDIO_REG)   ? "YES" : "no",    esp_efuse_get_field_size(ESP_EFUSE_XPD_SDIO_REG));
            dump_add_line(d, "XPD_SDIO_TIEH        : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_XPD_SDIO_TIEH)  ? "3.3V" : "1.8V", esp_efuse_get_field_size(ESP_EFUSE_XPD_SDIO_TIEH));
            dump_add_line(d, "XPD_SDIO_FORCE       : %s (size: %d)", esp_efuse_read_field_bit(ESP_EFUSE_XPD_SDIO_FORCE) ? "YES" : "no",    esp_efuse_get_field_size(ESP_EFUSE_XPD_SDIO_FORCE));

