FireVirtuozz/ESP32/esp_project/components/systemLib/systemLib.c
            uint8_t spi_clk=0, spi_q=0, spi_d=0, spi_cs0=0, spi_hd=0;
            esp_efuse_read_field_blob(ESP_EFUSE_SPI_PAD_CONFIG_CLK, &spi_clk,  esp_efuse_get_field_size(ESP_EFUSE_SPI_PAD_CONFIG_CLK));
            esp_efuse_read_field_blob(ESP_EFUSE_SPI_PAD_CONFIG_Q,   &spi_q,    esp_efuse_get_field_size(ESP_EFUSE_SPI_PAD_CONFIG_Q));
            esp_efuse_read_field_blob(ESP_EFUSE_SPI_PAD_CONFIG_D,   &spi_d,    esp_efuse_get_field_size(ESP_EFUSE_SPI_PAD_CONFIG_D));
            esp_efuse_read_field_blob(ESP_EFUSE_SPI_PAD_CONFIG_CS0, &spi_cs0,  esp_efuse_get_field_size(ESP_EFUSE_SPI_PAD_CONFIG_CS0));
            esp_efuse_read_field_blob(ESP_EFUSE_SPI_PAD_CONFIG_HD,  &spi_hd,   esp_efuse_get_field_size(ESP_EFUSE_SPI_PAD_CONFIG_HD));
            dump_add_line(d, "SPI_PAD_CLK          : %u (size: %d)", spi_clk,  esp_efuse_get_field_size(ESP_EFUSE_SPI_PAD_CONFIG_CLK));
            dump_add_line(d, "SPI_PAD_Q            : %u (size: %d)", spi_q,    esp_efuse_get_field_size(ESP_EFUSE_SPI_PAD_CONFIG_Q));
            dump_add_line(d, "SPI_PAD_D            : %u (size: %d)", spi_d,    esp_efuse_get_field_size(ESP_EFUSE_SPI_PAD_CONFIG_D));
            dump_add_line(d, "SPI_PAD_CS0          : %u (size: %d)", spi_cs0,  esp_efuse_get_field_size(ESP_EFUSE_SPI_PAD_CONFIG_CS0));
            dump_add_line(d, "SPI_PAD_HD           : %u (size: %d)", spi_hd,   esp_efuse_get_field_size(ESP_EFUSE_SPI_PAD_CONFIG_HD));
            dump_deploy(&d);

            // prevent double free
            d = NULL;
#endif
            
        } else if (is_key_block) {
            //key block
            bool wr_dis      = esp_efuse_get_key_dis_write(block);
            bool unused      = esp_efuse_key_block_unused(block);
            bool purpose_dis = esp_efuse_get_keypurpose_dis_write(block);
            esp_efuse_purpose_t purpose = esp_efuse_get_key_purpose(block);
            esp_efuse_block_t found_block;
            bool found = esp_efuse_find_purpose(purpose, &found_block);

            dump_add_line(d, "purpose         : %s", get_key_purpose_str(purpose));
            dump_add_line(d, "purpose find    : %s (BLK%d)", found ? "found" : "not found", found_block);
            dump_add_line(d, "unused          : %s", unused      ? "yes" : "no");
            dump_add_line(d, "read  protect   : %s", rd_dis      ? "YES" : "no");
            dump_add_line(d, "write protect   : %s", wr_dis      ? "YES" : "no");
            dump_add_line(d, "purpose wr dis  : %s", purpose_dis ? "YES" : "no");
            
        } else {
            //std block data 

            #if !CONFIG_IDF_TARGET_ESP32
            uint32_t num_reg = (range_read_addr_blocks_user[block].end - range_read_addr_blocks_user[block].start) / sizeof(uint32_t) + 1;
            #else
            uint32_t num_reg = 8;
            #endif
            for (int reg = 0; reg < num_reg; reg++) {
                uint32_t val = esp_efuse_read_reg(block, reg);
                dump_add_line(d, "  [%d] 0x%08lX", reg, val);
            }
        }

        if (d != NULL) dump_deploy(&d);
    }

    // ========== EVENT LOOP ==========
    char *buf = (char*)malloc(10001);
    if (buf == NULL) {
        log_msg(TAG, "malloc failed (event loop)");
    } else {
        memset(buf, 0, 10001);
        FILE *f = fmemopen(buf, 10000, "w");
        if (f == NULL) {
            log_msg(TAG, "fmemopen failed (event loop)");
        } else {
            err = esp_event_dump(f);
            fflush(f);
            fclose(f);
            if (err != ESP_OK) {
                log_msg(TAG, "Error (%s) event loop dump", esp_err_to_name(err));
            } else {
                d = dump_init("EVENT LOOP", TAG);
                char *ptr = buf;
                char *end = buf + strlen(buf);
                while (ptr < end) {
                    char *newline = strchr(ptr, '\n');
                    int len = newline ? (int)(newline - ptr) : (int)(end - ptr);
                    if (len > 0) dump_add_line(d, "%.*s", len, ptr);
                    ptr += len + (newline ? 1 : 0);
                }
                dump_deploy(&d);
            }
        }
        free(buf);
    }

    // ========== MMU MAPPED BLOCKS ==========
    char *buf_mmu = (char*)malloc(10001);
    if (buf_mmu == NULL) {
        log_msg(TAG, "malloc failed (mmu)");
    } else {
        memset(buf_mmu, 0, 10001);
        FILE *f = fmemopen(buf_mmu, 10000, "w");
        if (f == NULL) {
            log_msg(TAG, "fmemopen failed (mmu)");
        } else {
            err = esp_mmu_map_dump_mapped_blocks(f);
            fflush(f);
            fclose(f);
            if (err != ESP_OK) {
                log_msg(TAG, "Error (%s) mmu mapped blocks dump", esp_err_to_name(err));
            } else {
                d = dump_init("MMU BLOCKS", TAG);
                char *ptr = buf_mmu;
                char *end = buf_mmu + strlen(buf_mmu);
                while (ptr < end) {
                    char *newline = strchr(ptr, '\n');
                    int len = newline ? (int)(newline - ptr) : (int)(end - ptr);
                    if (len > 0) dump_add_line(d, "%.*s", len, ptr);
                    ptr += len + (newline ? 1 : 0);
                }
                dump_deploy(&d);
            }
        }
        free(buf_mmu);
    }
}

void restart_chip() {
    esp_restart();
}

/*system*/
//esp_register_shutdown_handler
//esp_unregister_shutdown_handler

//esp_reset_reason
//esp_system_abort

/*mac*/
//esp_base_mac_addr_set
//esp_efuse_mac_get_custom
//esp_read_mac
//esp_derive_local_mac
//esp_iface_mac_addr_set
//esp_mac_addr_len_get

/*cpu*/
//esp_cpu_stall
//esp_cpu_unstall
//esp_cpu_reset
//esp_cpu_wait_for_intr
//esp_cpu_set_cycle_count
//esp_cpu_pc_to_addr
//esp_cpu_set_threadptr
//esp_cpu_intr_set_handler
//esp_cpu_intr_enable
//esp_cpu_intr_disable
//esp_cpu_intr_edge_ack
//esp_cpu_configure_region_protection
//esp_cpu_set_breakpoint
//esp_cpu_clear_breakpoint
//esp_cpu_set_watchpoint
//esp_cpu_clear_watchpoint
//esp_cpu_dbgr_break
//esp_cpu_get_call_addr
//esp_cpu_compare_and_set